import React from "react";

const Introduce = () =>{
    return (
        <div id="page-profile-introduce">
            <h1>自己紹介</h1>
            私は現在韓国のMakeGenius社の開発部でWeb開発を担当している金丙根（キムビョングン）と申します。<br/>
            韓国の高麗大学コンピューター情報学科でソフトウェア開発について勉強しましたが、理論中心の教育ではなく実戦で使える教育を受けたくて中退を決心しました。<br/>
            その後国から支援してくれるWeb開発教育を申請し、６ヶ月間教育を受けて現在の会社に入社しました。<br/>
            業務内容としては
            <ul>
                <li>データベース設計、管理（MariaDB）</li>
                <li>バックエンド開発、運用、保守（Spring Framework、PHP）</li>
                <li>フロントエンド開発、運用、保守（JSP、javascript）</li>
                <li>Unity Appとの通信（API）開発、運用、保守</li>
            </ul>
            を担当しております。
            <hr/>
            <h1>何で日本で仕事をしたいのか</h1>
            日本の独特な市場性に興味を持ちました。<br/>
            日本は先進国だけど、デジタルよりもアナログ文化が発展した国でした。<br/>
            でも、コロナ事態以来、非対面サービスに対する需要が増え、エンジニアに対する需要も増えてきました。<br/>
            それは日本がこれまでのアナログ業務をデジタル化しなければならないことだと見ることができます。<br/>
            このような環境を私はこう判断しました。<br/>
            <ul>
                <li>
                    先進国の人々は質の高いサービスを望んでいるので、高い技術力が要求される
                </li>
                <li>
                    高い技術力のエンジニア陸生のため、企業からエンジニア陸生に力を入れる可能性が高い
                </li>
                <li>
                    新しく作るサービス環境が多いと予想されるため、多様な環境を経験できる可能性が高い
                </li>
            </ul>
            こう言う環境で仕事をしたら、エンジニアとして確実に成長出来ると思いまして日本就職を考えるようになりました。
            <hr/>
            <h1>その他</h1>
            趣味はゲーム、バドミントン、ピアノ、絵を描く、アニメを見ることです。<br/>
            <div className="end">
                何卒宜しくお願い致します！
            </div>
        </div>
    )
}

export default Introduce;